Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/employment_rights_and_conditions/leave_and_holidays/sick_leave.html.txt.tmx
Source language: en
Languages: ga

source: Sick leave and sick pay
ga: Saoire bhreoiteachta agus pá breoiteachta

source: In general, an employee has no right under employment law to be paid while on sick leave
ga: Go ginearálta, níl aon reachtaíocht fostaíochta i dtaobh shaoire breoiteachta

source: Consequently, it is at the discretion of the employer to decide their own policy on sick pay and sick leave, subject to the employee’s contract or terms of employment
ga: Dá bharr sin, faoin bhfostóir atá sé a p(h)olasaí féin maidir le pá breoiteachta agus saoire breoiteachta a shocrú, ag brath ar chonradh an fhostaithe nó a théarmaí fostaíochta

source: Under Section 3 of the Terms of Employment (Information) Act 1994 an employer must provide an employee with a written statement of terms of employment within two months of the commencement of the employment
ga: De réir Alt 3 an Achta um Théarmaí (Faisnéis) Fostaíochta 1994, ní mór don fhostóir ráiteas scríofa a thabhairt don fhostaí le téarmaí fostaíochta taobh istigh de dhá mhí ó thús na fostaíochta

source: One of the terms referred to in this Act on which the employer must provide information is the terms or conditions relating to incapacity for work due to sickness or injury
ga: Tagraíonn an tAcht do théarmaí a bhaineann le neamhinfheidhme mar gheall ar thinneas nó ghortú mar cheann de na téarmaí a gcaithfidh an fostóir eolas a thabhairt don fhostaí faoi

source: You may apply for Illness Benefit if you have enough social insurance contributions
ga: Féadfaidh tú iarratas a dhéanamh chun Sochar Breoiteachta a fháil má tá go leor ranníocaí árachais shóisialaigh agat

source: If you do not have enough social insurance contributions, you should contact the Department of Social Protection's representative (formerly the Community Welfare Officer) at your local health centre who will assess your situation
ga: Mura bhfuil go leor ranníocaí árachais shóisialaigh agat, ba chóir duit teagmháil a dhéanamh leis an t-ionadaí Roinne Coimirce Sóisialaí (a tugadh an tOifigeach Leasa Pobail air roimhe seo) de chuid d’ionaid sláinte áitiúla agus déanfaidh sé nó sí measúnú ar an riocht ina bhfuil tú

source: If you are entitled to sick pay, your employer will probably require you to sign over any Illness Benefit payment from the Department of Social Protection to your employer for as long as the sick pay continues
ga: Má tá teideal agat chun pá tinnis a fháil, is dócha go gceanglóidh d’fhostóir ort aon íocaíocht Sochair Breoiteachta ón Roinn Coimirce Sóisialaí a thabhairt do d’fhostóir a fhad a leanfar den phá tinnis a íoc leat

source: Often, your contract of employment will place a maximum period of sick pay entitlement in a stated period, for example, one month's sick pay in any 12-month period
ga: Is minic go sonraítear i gconradh fostaíochta uasteora le tréimhse pá breoiteachta le linn tréimhse áirithe, mar shampla, pá tinnis míosa in aon tréimhse 12 mhí

source: Clear rules should be put in place by the employer where an employee is sick and is unavailable for work
ga: Ba cheart don fhostóir rialacha soiléire a chur i bhfeidhm má tá fostaí tinn agus gan a bheith ar fáil don obair

source: For example, it should be clear that if you are sick and unavailable for work, you must contact a specified person by a certain time
ga: Mar shampla, ba cheart go mbeadh sé soiléir go gcaithfidh tú dul i dteagmháil le duine áirithe roimh am áirithe má tá tú tinn agus gan a bheith ar fáil don obair

source: Medical certificates: Your employer can require you to provide a medical certificate (from your GP or family doctor) when you are on sick leave
ga: Má tá tú ar saoire breoiteachta is féidir le d'fhostóir iarr ort teastas leighis a sholáthar (ó do dhochtúir teaghlaigh)

source: For example, you may have to provide a medical certificate if you are out sick for more than 2 consecutive days
ga: Mar shampla, má tá tú tinn agus as láthair le haghaidh níos mó ná 2 lá as a chéile, bíonn ort chomh maith teastas leighis a sholáthar

source: The medical certificate should state the date you are likely to return to work. If you are likely to be out sick for a longer period, your employer may require you provide weekly medical certificates
ga: Caithfidh an teastas leighis luaigh an dáta atáthar ag súil go mbeidh tú in ann dul ar ais ag an obair má tá tú tinn agus as láthair le haghaidh níos mó ná trí lá as a chéile

source: These guidelines provide defined periods of expected recovery and return to work in respect of common medical conditions and surgical procedures
ga: Más amhlaidh go mbeidh tú as láthair le haghaidh tréimhse níos faide, b’fhéidir go n-iarrfaidh do fhostóir ort teastais leighis a sholáthar go seachtainiúil

source: In some circumstances, where an employee has consistently been absent from work (or if through illness is no longer capable of continuing work), employment may be terminated
ga: I gcúinsí áirithe, nuair atá fostaí as láthair ón obair (nó gan a bheith in ann leanacht ar aghaidh leis an obair mar gheall ar thinneas) is féidir deireadh a chur leis an bhfostaíocht

source: Employees are protected in certain circumstances in this instance through the unfair dismissals legislation
ga: Sa chás seo bíonn cosaint i gcúinsí áirithe ag fostaithe faoi reachtaíocht dífhostú eagórach

source: If you are unsure about whether or not you are entitled to sick pay, you should consult your contract of employment or speak to your employer
ga: Má tá amhras ort an bhfuil tú i dteideal pá breoiteachta nó nach bhfuil, ba cheart duit breathnú ar do chonradh fostaíochta nó labhairt le do fhostóir

source: An employee who does not receive sick pay as their terms of employment may make a complaint under the Payment of Wages Act using the online complaint form available on workplacerelations.ie
ga: Is féidir le fostaí nach bhfaigheann pá breoiteachta atá dlite dó/di de réir a t(h)éarmaí fostaíochta, gearán a chur tríd an fhoirm ghearáin ar líne nua a úsáid á fáil ar workplacerelations.ie

source: Accident or injury at work
ga: Timpiste nó gortú le linn na hoibre

source: If you have an accident at work and you are not entitled to sick pay, you can apply for Injury Benefit
ga: Má tharlaíonn timpiste duit le linn na hoibre agus mura mbíonn teideal ar phá tinnis agat, d’fhéadfá iarratas ar Shocar Díobhála a dhéanamh

source: This is a weekly payment from the Department of Social Protection if you are unfit for work due to an accident at work or an occupational disease
ga: Íocaíocht sheachtainiúil é a dhéantar leat má tá tú neamhábalta chun na hoibre de bharr timpiste le linn na hoibre nó galar ceirde

source: Under the Medical Care Scheme you can claim certain medical costs that are not paid by the Health Service Executive (HSE) or covered by Treatment Benefit Scheme
ga: Faoin Scéim Chúram Leighis is féidir costais leighis áirithe nach mbíonn íoctha ag an bhFeidhmeannacht na Seirbhíse Sláinte nó tríd an Sochar Cóir Leighis a fháil

source: You can find out more about these payments in our document on the Occupational Injuries Benefit Scheme
ga: Tá tuilleadh eolais ar fáil inár ndoiciméad faoin Scéim na Sochair Gortuithe Ceirde

source: If you are entitled to sick pay, your employer will probably require you to sign over any Injury Benefit payment from the Department of Social Protection to your employer for as long as the sick pay continues
ga: Má tá teideal agat chun pá tinnis a fháil, is dócha go gceanglóidh d’fhostóir ort aon íocaíocht Sochair Díobhála ón Roinn Coimirce Sóisialaí a thabhairt do d’fhostóir a fhad a leanfar den phá tinnis a íoc leat

source: If you have suffered an injury at work, you can seek compensation from your employer by making a personal injury claim through InjuriesBoard.ie
ga: Má tá gortú fulaingthe agat san ionad oibre, is féidir leat cúiteamh a lorg trí d'fhostóir má dhéanann tú éileamh tríd InjuriesBoard.ie

source: You can read more about this in our document on health and safety in the workplace
ga: Tá tuilleadh eolais ar fáil inár ndoiciméad faoi shláinte agus sábháilteacht san ionad oibre

source: Sick leave during public holidays
ga: Saoire breoiteachta i rith laethanta saoire poiblí

source: If you are a full time worker who is on sick leave during a public holiday, you are entitled to benefit for the public holiday you missed
ga: Más oibrí lánaimseartha tú atá ar saoire breoiteachta i rith lae/laethanta saoire poiblí, tá tú i dteideal sochar saoire poiblí a fháil ón obair i gcomhair an lae/na laethanta saoire poiblí a chaill tú

source: If you are a part-time worker on sick leave during a public holiday, you would be entitled to time off work for the public holiday provided you worked for your employer at least 40 hours in the previous 5-week period
ga: Más oibrí páirtaimseartha tú atá ar saoire breoiteachta le linn lae/laethanta saoire poiblí, tá tú i dteideal am saor a fháil ón obair chomh fada agus gur oibrigh tú 40 uair an chloig san tréimhse 5 seachtain roimh ré

source: However, you are not entitled to the public holiday if you are absent from work immediately before the public holiday and you have been off work for more than 26 weeks due to an ordinary illness or accident, or for more than 52 weeks due to an occupational accident
ga: Áfach, má tá tú neamhláithreach ó obair díreach roimh an lá saoire phoiblí agus má tá tú neamhláithreach ó obair le níos mó ná 26 seachtaine de bharr tinnis choitianta nó timpiste, agus i gcás tionóisce cheirde 52 seachtaine, níl tú i dteideal an saoire phoiblí

source: Sick leave and annual leave
ga: Saoire breoiteachta agus saoire bhliantúil

source: If you are ill during your annual leave and have a medical certificate for the days you were ill, these sick days will not be counted as annual leave days
ga: Má bhíonn tú tinn le linn do shaoire bhliantúil agus go bhfuil teastas leighis agat do na laethanta a bhí tú tinn ní áireofar mar laethanta saoire bhliantúil na laethanta tinnis seo

source: Instead, you can use these days as annual leave at a later date
ga: Ina ionad sin, is féidir leat na laethanta sin a úsáid mar shaoire bhliantúil ag dáta níos déanaí

source: An employer cannot require you to take annual leave for a certified period of illness
ga: Ní féidir le d'fhostóir iallach a chur ort saoire bhliantúil a thógáil i gcomhair tréimhse thinnis teistithe

source: Since 1 August 2015, you accumulate statutory annual leave entitlement during a period of certified sick leave
ga: Ó 1 Lúnasa 2015, is féidir teidlíocht saoire bliantúil reachtúil a fhabhrú i rith thréimhse shaoire bhreoiteachta teistithe

source: Employees on long-term sick leave can retain annual leave they could not take due to illness for up to 15 months after the end of the year in which it is accrued
ga: Is féidir oibrithe saoire bhliantúil nach féidir leo glacadh de bharr breoiteachta a choinnigh suas go 15 mhí i ndiaidh deireadh an bhliain ina bhfuil sé fabhraithe

source: Workers who leave their employment within 15 months of the end of the year in which this annual leave was accrued, are entitled to payment in lieu of this leave which was untaken due to illness
ga: Táoibrithe a fhágann a fhostaíocht laistigh de 15 mhí i ndiaidh deireadh anbhliain ina bhfuil an tsaoire bhliantúil fabhraithe, i dteideal íocaíocht ináit an tsaoire seo, nach bhfuil tógtha de bharr tinnis
